NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B820F2048IQ100.svd
        <register>
          <name>LFRCOCTRL</name>
          <description>LFRCO Control Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x81060100</resetValue>
          <resetMask>0xF33701FF</resetMask>
          <fields>
            <field>
              <name>TUNING</name>
              <description>LFRCO Tuning Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENVREF</name>
              <description>Enable Duty Cycling of Vref</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCHOP</name>
              <description>Enable Comparator Chopping</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDEM</name>
              <description>Enable Dynamic Element Matching</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREFUPDATE</name>
              <description>Control Vref Update Rate</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>32 clocks.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CYCLES</name>
                  <description>64 clocks.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CYCLES</name>
                  <description>128 clocks.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CYCLES</name>
                  <description>256 clocks.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>LFRCO Timeout</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Timeout period of 2 cycles</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CYCLES</name>
                  <description>Timeout period of 16 cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>Timeout period of 32 cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GMCCURTUNE</name>
              <description>Tuning of Gmc Current</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOCTRL</name>
          <description>HFXO Control Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x3700003B</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>HFXO Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>4 MHz - 50 MHz crystal oscillator</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACBUFEXTCLK</name>
                  <description>An AC coupled buffer is coupled in series with HFXTAL_N pin, suitable for external sinus wave.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCBUFEXTCLK</name>
                  <description>A DC coupled buffer is coupled in series with HFXTAL_N pin, suitable for external sinus wave.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGEXTCLK</name>
                  <description>Digital external clock can be supplied on HFXTAL_N pin.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXOX2EN</name>
              <description>Enable Double Frequency on HFXOX2 Clock (compared to HFXO Clock)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKDETMODE</name>
              <description>HFXO Automatic Peak Detection Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONCECMD</name>
                  <description>Automatic control of HFXO peak detection sequence. Only performs peak detection on initial HFXO startup. CMU_CMD HFXOPEAKDETSTART allowed to be used after HFXORDY=1.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOCMD</name>
                  <description>Automatic control of HFXO peak detection sequence. CMU_CMD HFXOPEAKDETSTART allowed to be used after HFXORDY=1.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD</name>
                  <description>CMU_CMD HFXOPEAKDETSTART can be used to trigger the peak detection sequence after HFXORDY=1.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>CMU_HFXOSTEADYSTATECTRL IBTRIMXOCORE and PEAKDETEN are under full software control and are allowed to be changed once HFXO is ready.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFTIMEOUT</name>
              <description>HFXO Low Frequency Timeout</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0CYCLES</name>
                  <description>Timeout period of 0 cycles (disabled)</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Timeout period of 2 cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CYCLES</name>
                  <description>Timeout period of 4 cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CYCLES</name>
                  <description>Timeout period of 16 cycles</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>Timeout period of 32 cycles</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CYCLES</name>
                  <description>Timeout period of 64 cycles</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCYCLES</name>
                  <description>Timeout period of 1024 cycles</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCYCLES</name>
                  <description>Timeout period of 4096 cycles</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOSTARTEM0EM1</name>
              <description>Automatically Start of HFXO Upon EM0/EM1 Entry From EM2/EM3</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOSTARTSELEM0EM1</name>
              <description>Automatically Start and Select of HFXO Upon EM0/EM1 Entry From EM2/EM3</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOCTRL1</name>
          <description>HFXO Control 1</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <resetMask>0x00007000</resetMask>
          <fields>
            <field>
              <name>PEAKDETTHR</name>
              <description>Sets the Amplitude Detection Level (mV)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THR0</name>
                  <description>50mV amplitude detection level</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THR1</name>
                  <description>75mV amplitude detection level</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THR2</name>
                  <description>115mV amplitude detection level</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THR3</name>
                  <description>160mV amplitude detection level</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THR4</name>
                  <description>220mV amplitude detection level</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THR5</name>
                  <description>260mV amplitude detection level</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THR6</name>
                  <description>320mV amplitude detection level</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THR7</name>
                  <description>Same as THR6</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOSTARTUPCTRL</name>
          <description>HFXO Startup Control</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000600</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>IBTRIMXOCORE</name>
              <description>Sets the Startup Oscillator Core Bias Current</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE</name>
              <description>Sets Oscillator Tuning Capacitance</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOSTEADYSTATECTRL</name>
          <description>HFXO Steady State Control</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x08000100</resetValue>
          <resetMask>0x0C0FFFFF</resetMask>
          <fields>
            <field>
              <name>IBTRIMXOCORE</name>
              <description>Sets the Steady State Oscillator Core Bias Current.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE</name>
              <description>Sets Oscillator Tuning Capacitance</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKDETEN</name>
              <description>Enables Oscillator Peak Detectors</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKMONEN</name>
              <description>Automatically Perform Peak Monitoring Algorithm on Every Rising Edge of ULFRCO</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
